import { ApiProperty } from "@nestjs/swagger";
import { IsNotEmpty, IsString, Length, Matches } from "class-validator";

export class VacancyCreateDto {
    @ApiProperty({example: "Frontend разработчик", description: "Название вакансии. Не меньше 1 символа и не длинее 60. Название вакансии не может быть пустым."})
    @IsNotEmpty({ message: 'Название вакансии не должно быть пустым' })
    @IsString({message: "Должно быть строкой"})
    @Length(1, 60, {message: "Не меньше 1 символа и не длинее 60"})
    readonly title: string;

    @ApiProperty({example: "Мы приглашаем опытного фронтенд-разработчика в нашу динамичную команду. Кандидат должен обладать глубоким пониманием современных веб-технологий, отличными навыками в HTML, CSS и JavaScript, а также опытом работы с фреймворками, такими как React, Angular или Vue. Ответственность за создание интуитивно понятных и эстетичных пользовательских интерфейсов, оптимизацию производительности и поддержание совместимости с различными браузерами. Успешный кандидат должен быть готов работать в команде, проявлять инициативу и следовать лучшим практикам в области фронтенд-разработки. Мы предлагаем увлекательные проекты, возможности для профессионального роста и дружелюбную рабочую атмосферу.", description: "Контентная часть. Не меньше 1 символа и не длинее 800. Контентная часть не может быть пустой."})
    @IsNotEmpty({ message: 'Контентная часть не должна быть пустой'})
    @IsString({message: "Должно быть строкой"})
    @Length(1, 800, {message: "Не меньше 1 символа и не длинее 800"})
    readonly content: string;

    @ApiProperty({example: "Работать в тесном сотрудничестве с командой развития продукта; Консультировать менеджеров; Дискутировать по поводу стратегических решений компании;", description: "Обязанности в компании. Не меньше 1 символа и не длинее 300. Собирайте массив строк и объединяйте его в строку с разделением через ; "})
    @IsNotEmpty({ message: 'Обязанности не должны быть пустыми' })
    @IsString({message: "Должно быть строкой"})
    @Length(1, 300, {message: "Не меньше 1 символа и не длинее 300"})
    readonly duties: string;

    @ApiProperty({example: "Работать в тесном сотрудничестве с командой развития продукта; Консультировать менеджеров; Дискутировать по поводу стратегических решений компании;", description: "Обязанности в компании. Не меньше 1 символа и не длинее 400. Собирайте массив строк и объединяйте его в строку с разделением через ; "})
    @IsNotEmpty({ message: 'Требования не должны быть пустыми' })
    @IsString({message: "Должно быть строкой"})
    @Length(1, 400, {message: "Не меньше 1 символа и не длинее 400"})
    readonly requirements: string;

    @ApiProperty({example: "С 7 утра до 16 вечера", description: "График работы в компании. Не меньше 1 символа и не длинее 40."})
    @IsNotEmpty({ message: 'Режим работы не должен быть пустым' })
    @IsString({message: "Должно быть строкой"})
    @Length(1, 40, {message: "Не меньше 1 символа и не длинее 40"})
    readonly workMode: string;
}